tutorials/jets/CNRS_jet_old/flow_2D_laminar/0.org/gas/He
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      He;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    electrode
    {
        type            fixedValue;
        value           $internalField;
    }

    gasInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    gas_to_dielectric
    {
        type            fixedValue;
        value           $internalField;
    }

    gas_to_region0
    {
        type            fixedValue;
        value           $internalField;
    }

    axis
    {
        type            empty;
    }

    frontWedge
    {
        type            wedge;
    }

    backWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
